GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.h
extern volatile INLVLFbits_t INLVLFbits __at(0x1E54);
// bitfield macros
#define _INLVLF_INLVLF0_POSN                                0x0
#define _INLVLF_INLVLF0_POSITION                            0x0
#define _INLVLF_INLVLF0_SIZE                                0x1
#define _INLVLF_INLVLF0_LENGTH                              0x1
#define _INLVLF_INLVLF0_MASK                                0x1
#define _INLVLF_INLVLF1_POSN                                0x1
#define _INLVLF_INLVLF1_POSITION                            0x1
#define _INLVLF_INLVLF1_SIZE                                0x1
#define _INLVLF_INLVLF1_LENGTH                              0x1
#define _INLVLF_INLVLF1_MASK                                0x2
#define _INLVLF_INLVLF2_POSN                                0x2
#define _INLVLF_INLVLF2_POSITION                            0x2
#define _INLVLF_INLVLF2_SIZE                                0x1
#define _INLVLF_INLVLF2_LENGTH                              0x1
#define _INLVLF_INLVLF2_MASK                                0x4
#define _INLVLF_INLVLF3_POSN                                0x3
#define _INLVLF_INLVLF3_POSITION                            0x3
#define _INLVLF_INLVLF3_SIZE                                0x1
#define _INLVLF_INLVLF3_LENGTH                              0x1
#define _INLVLF_INLVLF3_MASK                                0x8
#define _INLVLF_INLVLF4_POSN                                0x4
#define _INLVLF_INLVLF4_POSITION                            0x4
#define _INLVLF_INLVLF4_SIZE                                0x1
#define _INLVLF_INLVLF4_LENGTH                              0x1
#define _INLVLF_INLVLF4_MASK                                0x10
#define _INLVLF_INLVLF5_POSN                                0x5
#define _INLVLF_INLVLF5_POSITION                            0x5
#define _INLVLF_INLVLF5_SIZE                                0x1
#define _INLVLF_INLVLF5_LENGTH                              0x1
#define _INLVLF_INLVLF5_MASK                                0x20
#define _INLVLF_INLVLF6_POSN                                0x6
#define _INLVLF_INLVLF6_POSITION                            0x6
#define _INLVLF_INLVLF6_SIZE                                0x1
#define _INLVLF_INLVLF6_LENGTH                              0x1
#define _INLVLF_INLVLF6_MASK                                0x40
#define _INLVLF_INLVLF7_POSN                                0x7
#define _INLVLF_INLVLF7_POSITION                            0x7
#define _INLVLF_INLVLF7_SIZE                                0x1
#define _INLVLF_INLVLF7_LENGTH                              0x1
#define _INLVLF_INLVLF7_MASK                                0x80

// Register: HIDRVF
#define HIDRVF HIDRVF
extern volatile unsigned char           HIDRVF              __at(0x1E55);
#ifndef _LIB_BUILD
asm("HIDRVF equ 01E55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned HIDF7                  :1;
    };
} HIDRVFbits_t;
extern volatile HIDRVFbits_t HIDRVFbits __at(0x1E55);
// bitfield macros
#define _HIDRVF_HIDF7_POSN                                  0x7
#define _HIDRVF_HIDF7_POSITION                              0x7
#define _HIDRVF_HIDF7_SIZE                                  0x1
#define _HIDRVF_HIDF7_LENGTH                                0x1
#define _HIDRVF_HIDF7_MASK                                  0x80

// Register: ANSELG
#define ANSELG ANSELG
extern volatile unsigned char           ANSELG              __at(0x1E5B);
#ifndef _LIB_BUILD
asm("ANSELG equ 01E5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSG0                  :1;
        unsigned ANSG1                  :1;
        unsigned ANSG2                  :1;
        unsigned ANSG3                  :1;
        unsigned ANSG4                  :1;
        unsigned                        :1;
        unsigned ANSG6                  :1;
        unsigned ANSG7                  :1;
    };
} ANSELGbits_t;
extern volatile ANSELGbits_t ANSELGbits __at(0x1E5B);
// bitfield macros
#define _ANSELG_ANSG0_POSN                                  0x0
#define _ANSELG_ANSG0_POSITION                              0x0
#define _ANSELG_ANSG0_SIZE                                  0x1
#define _ANSELG_ANSG0_LENGTH                                0x1
#define _ANSELG_ANSG0_MASK                                  0x1
#define _ANSELG_ANSG1_POSN                                  0x1
#define _ANSELG_ANSG1_POSITION                              0x1
#define _ANSELG_ANSG1_SIZE                                  0x1
#define _ANSELG_ANSG1_LENGTH                                0x1
#define _ANSELG_ANSG1_MASK                                  0x2
#define _ANSELG_ANSG2_POSN                                  0x2
#define _ANSELG_ANSG2_POSITION                              0x2
#define _ANSELG_ANSG2_SIZE                                  0x1
#define _ANSELG_ANSG2_LENGTH                                0x1
#define _ANSELG_ANSG2_MASK                                  0x4
#define _ANSELG_ANSG3_POSN                                  0x3
#define _ANSELG_ANSG3_POSITION                              0x3
#define _ANSELG_ANSG3_SIZE                                  0x1
#define _ANSELG_ANSG3_LENGTH                                0x1
#define _ANSELG_ANSG3_MASK                                  0x8
#define _ANSELG_ANSG4_POSN                                  0x4
#define _ANSELG_ANSG4_POSITION                              0x4
#define _ANSELG_ANSG4_SIZE                                  0x1
#define _ANSELG_ANSG4_LENGTH                                0x1
#define _ANSELG_ANSG4_MASK                                  0x10
#define _ANSELG_ANSG6_POSN                                  0x6
#define _ANSELG_ANSG6_POSITION                              0x6
#define _ANSELG_ANSG6_SIZE                                  0x1
#define _ANSELG_ANSG6_LENGTH                                0x1
#define _ANSELG_ANSG6_MASK                                  0x40
#define _ANSELG_ANSG7_POSN                                  0x7
#define _ANSELG_ANSG7_POSITION                              0x7
#define _ANSELG_ANSG7_SIZE                                  0x1
#define _ANSELG_ANSG7_LENGTH                                0x1
#define _ANSELG_ANSG7_MASK                                  0x80

// Register: WPUG
#define WPUG WPUG
extern volatile unsigned char           WPUG                __at(0x1E5C);
#ifndef _LIB_BUILD
asm("WPUG equ 01E5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUG0                  :1;
        unsigned WPUG1                  :1;
        unsigned WPUG2                  :1;
        unsigned WPUG3                  :1;
        unsigned WPUG4                  :1;
        unsigned WPUG5                  :1;
        unsigned WPUG6                  :1;
        unsigned WPUG7                  :1;
    };
} WPUGbits_t;
