GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.h
// Register: WPUH
#define WPUH WPUH
extern volatile unsigned char           WPUH                __at(0x1E67);
#ifndef _LIB_BUILD
asm("WPUH equ 01E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUH0                  :1;
        unsigned WPUH1                  :1;
        unsigned WPUH2                  :1;
        unsigned WPUH3                  :1;
    };
} WPUHbits_t;
extern volatile WPUHbits_t WPUHbits __at(0x1E67);
// bitfield macros
#define _WPUH_WPUH0_POSN                                    0x0
#define _WPUH_WPUH0_POSITION                                0x0
#define _WPUH_WPUH0_SIZE                                    0x1
#define _WPUH_WPUH0_LENGTH                                  0x1
#define _WPUH_WPUH0_MASK                                    0x1
#define _WPUH_WPUH1_POSN                                    0x1
#define _WPUH_WPUH1_POSITION                                0x1
#define _WPUH_WPUH1_SIZE                                    0x1
#define _WPUH_WPUH1_LENGTH                                  0x1
#define _WPUH_WPUH1_MASK                                    0x2
#define _WPUH_WPUH2_POSN                                    0x2
#define _WPUH_WPUH2_POSITION                                0x2
#define _WPUH_WPUH2_SIZE                                    0x1
#define _WPUH_WPUH2_LENGTH                                  0x1
#define _WPUH_WPUH2_MASK                                    0x4
#define _WPUH_WPUH3_POSN                                    0x3
#define _WPUH_WPUH3_POSITION                                0x3
#define _WPUH_WPUH3_SIZE                                    0x1
#define _WPUH_WPUH3_LENGTH                                  0x1
#define _WPUH_WPUH3_MASK                                    0x8

// Register: ODCONH
#define ODCONH ODCONH
extern volatile unsigned char           ODCONH              __at(0x1E68);
#ifndef _LIB_BUILD
asm("ODCONH equ 01E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCH0                  :1;
        unsigned ODCH1                  :1;
        unsigned ODCH2                  :1;
        unsigned ODCH3                  :1;
    };
} ODCONHbits_t;
extern volatile ODCONHbits_t ODCONHbits __at(0x1E68);
// bitfield macros
#define _ODCONH_ODCH0_POSN                                  0x0
#define _ODCONH_ODCH0_POSITION                              0x0
#define _ODCONH_ODCH0_SIZE                                  0x1
#define _ODCONH_ODCH0_LENGTH                                0x1
#define _ODCONH_ODCH0_MASK                                  0x1
#define _ODCONH_ODCH1_POSN                                  0x1
#define _ODCONH_ODCH1_POSITION                              0x1
#define _ODCONH_ODCH1_SIZE                                  0x1
#define _ODCONH_ODCH1_LENGTH                                0x1
#define _ODCONH_ODCH1_MASK                                  0x2
#define _ODCONH_ODCH2_POSN                                  0x2
#define _ODCONH_ODCH2_POSITION                              0x2
#define _ODCONH_ODCH2_SIZE                                  0x1
#define _ODCONH_ODCH2_LENGTH                                0x1
#define _ODCONH_ODCH2_MASK                                  0x4
#define _ODCONH_ODCH3_POSN                                  0x3
#define _ODCONH_ODCH3_POSITION                              0x3
#define _ODCONH_ODCH3_SIZE                                  0x1
#define _ODCONH_ODCH3_LENGTH                                0x1
#define _ODCONH_ODCH3_MASK                                  0x8

// Register: SLRCONH
#define SLRCONH SLRCONH
extern volatile unsigned char           SLRCONH             __at(0x1E69);
#ifndef _LIB_BUILD
asm("SLRCONH equ 01E69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRH0                  :1;
        unsigned SLRH1                  :1;
        unsigned SLRH2                  :1;
        unsigned SLRH3                  :1;
    };
} SLRCONHbits_t;
extern volatile SLRCONHbits_t SLRCONHbits __at(0x1E69);
// bitfield macros
#define _SLRCONH_SLRH0_POSN                                 0x0
#define _SLRCONH_SLRH0_POSITION                             0x0
#define _SLRCONH_SLRH0_SIZE                                 0x1
#define _SLRCONH_SLRH0_LENGTH                               0x1
#define _SLRCONH_SLRH0_MASK                                 0x1
#define _SLRCONH_SLRH1_POSN                                 0x1
#define _SLRCONH_SLRH1_POSITION                             0x1
#define _SLRCONH_SLRH1_SIZE                                 0x1
#define _SLRCONH_SLRH1_LENGTH                               0x1
#define _SLRCONH_SLRH1_MASK                                 0x2
#define _SLRCONH_SLRH2_POSN                                 0x2
#define _SLRCONH_SLRH2_POSITION                             0x2
#define _SLRCONH_SLRH2_SIZE                                 0x1
#define _SLRCONH_SLRH2_LENGTH                               0x1
#define _SLRCONH_SLRH2_MASK                                 0x4
#define _SLRCONH_SLRH3_POSN                                 0x3
#define _SLRCONH_SLRH3_POSITION                             0x3
#define _SLRCONH_SLRH3_SIZE                                 0x1
#define _SLRCONH_SLRH3_LENGTH                               0x1
#define _SLRCONH_SLRH3_MASK                                 0x8

// Register: INLVLH
#define INLVLH INLVLH
extern volatile unsigned char           INLVLH              __at(0x1E6A);
#ifndef _LIB_BUILD
asm("INLVLH equ 01E6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLH0                :1;
        unsigned INLVLH1                :1;
        unsigned INLVLH2                :1;
        unsigned INLVLH3                :1;
    };
} INLVLHbits_t;
extern volatile INLVLHbits_t INLVLHbits __at(0x1E6A);
// bitfield macros
#define _INLVLH_INLVLH0_POSN                                0x0
#define _INLVLH_INLVLH0_POSITION                            0x0
#define _INLVLH_INLVLH0_SIZE                                0x1
#define _INLVLH_INLVLH0_LENGTH                              0x1
#define _INLVLH_INLVLH0_MASK                                0x1
#define _INLVLH_INLVLH1_POSN                                0x1
#define _INLVLH_INLVLH1_POSITION                            0x1
#define _INLVLH_INLVLH1_SIZE                                0x1
#define _INLVLH_INLVLH1_LENGTH                              0x1
#define _INLVLH_INLVLH1_MASK                                0x2
#define _INLVLH_INLVLH2_POSN                                0x2
#define _INLVLH_INLVLH2_POSITION                            0x2
#define _INLVLH_INLVLH2_SIZE                                0x1
#define _INLVLH_INLVLH2_LENGTH                              0x1
#define _INLVLH_INLVLH2_MASK                                0x4
#define _INLVLH_INLVLH3_POSN                                0x3
#define _INLVLH_INLVLH3_POSITION                            0x3
#define _INLVLH_INLVLH3_SIZE                                0x1
#define _INLVLH_INLVLH3_LENGTH                              0x1
#define _INLVLH_INLVLH3_MASK                                0x8

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x1E8F);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 01E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x1E8F);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INTPPS
#define INTPPS INTPPS
extern volatile unsigned char           INTPPS              __at(0x1E90);
#ifndef _LIB_BUILD
asm("INTPPS equ 01E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPPS                 :6;
    };
    struct {
        unsigned INTPPS0                :1;
        unsigned INTPPS1                :1;
        unsigned INTPPS2                :1;
        unsigned INTPPS3                :1;
        unsigned INTPPS4                :1;
    };
} INTPPSbits_t;
extern volatile INTPPSbits_t INTPPSbits __at(0x1E90);
// bitfield macros
#define _INTPPS_INTPPS_POSN                                 0x0
#define _INTPPS_INTPPS_POSITION                             0x0
#define _INTPPS_INTPPS_SIZE                                 0x6
#define _INTPPS_INTPPS_LENGTH                               0x6
#define _INTPPS_INTPPS_MASK                                 0x3F
#define _INTPPS_INTPPS0_POSN                                0x0
#define _INTPPS_INTPPS0_POSITION                            0x0
#define _INTPPS_INTPPS0_SIZE                                0x1
#define _INTPPS_INTPPS0_LENGTH                              0x1
#define _INTPPS_INTPPS0_MASK                                0x1
#define _INTPPS_INTPPS1_POSN                                0x1
#define _INTPPS_INTPPS1_POSITION                            0x1
#define _INTPPS_INTPPS1_SIZE                                0x1
#define _INTPPS_INTPPS1_LENGTH                              0x1
#define _INTPPS_INTPPS1_MASK                                0x2
#define _INTPPS_INTPPS2_POSN                                0x2
#define _INTPPS_INTPPS2_POSITION                            0x2
#define _INTPPS_INTPPS2_SIZE                                0x1
#define _INTPPS_INTPPS2_LENGTH                              0x1
#define _INTPPS_INTPPS2_MASK                                0x4
#define _INTPPS_INTPPS3_POSN                                0x3
#define _INTPPS_INTPPS3_POSITION                            0x3
#define _INTPPS_INTPPS3_SIZE                                0x1
#define _INTPPS_INTPPS3_LENGTH                              0x1
#define _INTPPS_INTPPS3_MASK                                0x8
#define _INTPPS_INTPPS4_POSN                                0x4
#define _INTPPS_INTPPS4_POSITION                            0x4
#define _INTPPS_INTPPS4_SIZE                                0x1
#define _INTPPS_INTPPS4_LENGTH                              0x1
#define _INTPPS_INTPPS4_MASK                                0x10

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x1E91);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 01E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :6;
    };
    struct {
        unsigned T0CKIPPS0              :1;
        unsigned T0CKIPPS1              :1;
        unsigned T0CKIPPS2              :1;
        unsigned T0CKIPPS3              :1;
        unsigned T0CKIPPS4              :1;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x1E91);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x6
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x6
#define _T0CKIPPS_T0CKIPPS_MASK                             0x3F
#define _T0CKIPPS_T0CKIPPS0_POSN                            0x0
#define _T0CKIPPS_T0CKIPPS0_POSITION                        0x0
#define _T0CKIPPS_T0CKIPPS0_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS0_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS0_MASK                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSN                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSITION                        0x1
#define _T0CKIPPS_T0CKIPPS1_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS1_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS1_MASK                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSN                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSITION                        0x2
#define _T0CKIPPS_T0CKIPPS2_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS2_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS2_MASK                            0x4
#define _T0CKIPPS_T0CKIPPS3_POSN                            0x3
#define _T0CKIPPS_T0CKIPPS3_POSITION                        0x3
#define _T0CKIPPS_T0CKIPPS3_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS3_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS3_MASK                            0x8
#define _T0CKIPPS_T0CKIPPS4_POSN                            0x4
#define _T0CKIPPS_T0CKIPPS4_POSITION                        0x4
#define _T0CKIPPS_T0CKIPPS4_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS4_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS4_MASK                            0x10

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x1E92);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 01E92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :6;
    };
    struct {
        unsigned T1CKIPPS0              :1;
        unsigned T1CKIPPS1              :1;
        unsigned T1CKIPPS2              :1;
        unsigned T1CKIPPS3              :1;
        unsigned T1CKIPPS4              :1;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0x1E92);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x6
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x6
#define _T1CKIPPS_T1CKIPPS_MASK                             0x3F
#define _T1CKIPPS_T1CKIPPS0_POSN                            0x0
#define _T1CKIPPS_T1CKIPPS0_POSITION                        0x0
#define _T1CKIPPS_T1CKIPPS0_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS0_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS0_MASK                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSN                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSITION                        0x1
#define _T1CKIPPS_T1CKIPPS1_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS1_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS1_MASK                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSN                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSITION                        0x2
#define _T1CKIPPS_T1CKIPPS2_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS2_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS2_MASK                            0x4
#define _T1CKIPPS_T1CKIPPS3_POSN                            0x3
#define _T1CKIPPS_T1CKIPPS3_POSITION                        0x3
#define _T1CKIPPS_T1CKIPPS3_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS3_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS3_MASK                            0x8
#define _T1CKIPPS_T1CKIPPS4_POSN                            0x4
#define _T1CKIPPS_T1CKIPPS4_POSITION                        0x4
#define _T1CKIPPS_T1CKIPPS4_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS4_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS4_MASK                            0x10

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0x1E93);
#ifndef _LIB_BUILD
asm("T1GPPS equ 01E93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :6;
    };
    struct {
        unsigned T1GPPS0                :1;
        unsigned T1GPPS1                :1;
        unsigned T1GPPS2                :1;
        unsigned T1GPPS3                :1;
        unsigned T1GPPS4                :1;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0x1E93);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x6
#define _T1GPPS_T1GPPS_LENGTH                               0x6
#define _T1GPPS_T1GPPS_MASK                                 0x3F
#define _T1GPPS_T1GPPS0_POSN                                0x0
#define _T1GPPS_T1GPPS0_POSITION                            0x0
#define _T1GPPS_T1GPPS0_SIZE                                0x1
#define _T1GPPS_T1GPPS0_LENGTH                              0x1
#define _T1GPPS_T1GPPS0_MASK                                0x1
#define _T1GPPS_T1GPPS1_POSN                                0x1
#define _T1GPPS_T1GPPS1_POSITION                            0x1
#define _T1GPPS_T1GPPS1_SIZE                                0x1
#define _T1GPPS_T1GPPS1_LENGTH                              0x1
#define _T1GPPS_T1GPPS1_MASK                                0x2
#define _T1GPPS_T1GPPS2_POSN                                0x2
#define _T1GPPS_T1GPPS2_POSITION                            0x2
#define _T1GPPS_T1GPPS2_SIZE                                0x1
#define _T1GPPS_T1GPPS2_LENGTH                              0x1
#define _T1GPPS_T1GPPS2_MASK                                0x4
#define _T1GPPS_T1GPPS3_POSN                                0x3
#define _T1GPPS_T1GPPS3_POSITION                            0x3
#define _T1GPPS_T1GPPS3_SIZE                                0x1
#define _T1GPPS_T1GPPS3_LENGTH                              0x1
#define _T1GPPS_T1GPPS3_MASK                                0x8
#define _T1GPPS_T1GPPS4_POSN                                0x4
#define _T1GPPS_T1GPPS4_POSITION                            0x4
#define _T1GPPS_T1GPPS4_SIZE                                0x1
#define _T1GPPS_T1GPPS4_LENGTH                              0x1
#define _T1GPPS_T1GPPS4_MASK                                0x10

