GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.h
// Register: RE5PPS
#define RE5PPS RE5PPS
extern volatile unsigned char           RE5PPS              __at(0x1F35);
#ifndef _LIB_BUILD
asm("RE5PPS equ 01F35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE5PPS0                :1;
        unsigned RE5PPS1                :1;
        unsigned RE5PPS2                :1;
        unsigned RE5PPS3                :1;
        unsigned RE5PPS4                :1;
        unsigned RE5PPS5                :1;
    };
} RE5PPSbits_t;
extern volatile RE5PPSbits_t RE5PPSbits __at(0x1F35);
// bitfield macros
#define _RE5PPS_RE5PPS0_POSN                                0x0
#define _RE5PPS_RE5PPS0_POSITION                            0x0
#define _RE5PPS_RE5PPS0_SIZE                                0x1
#define _RE5PPS_RE5PPS0_LENGTH                              0x1
#define _RE5PPS_RE5PPS0_MASK                                0x1
#define _RE5PPS_RE5PPS1_POSN                                0x1
#define _RE5PPS_RE5PPS1_POSITION                            0x1
#define _RE5PPS_RE5PPS1_SIZE                                0x1
#define _RE5PPS_RE5PPS1_LENGTH                              0x1
#define _RE5PPS_RE5PPS1_MASK                                0x2
#define _RE5PPS_RE5PPS2_POSN                                0x2
#define _RE5PPS_RE5PPS2_POSITION                            0x2
#define _RE5PPS_RE5PPS2_SIZE                                0x1
#define _RE5PPS_RE5PPS2_LENGTH                              0x1
#define _RE5PPS_RE5PPS2_MASK                                0x4
#define _RE5PPS_RE5PPS3_POSN                                0x3
#define _RE5PPS_RE5PPS3_POSITION                            0x3
#define _RE5PPS_RE5PPS3_SIZE                                0x1
#define _RE5PPS_RE5PPS3_LENGTH                              0x1
#define _RE5PPS_RE5PPS3_MASK                                0x8
#define _RE5PPS_RE5PPS4_POSN                                0x4
#define _RE5PPS_RE5PPS4_POSITION                            0x4
#define _RE5PPS_RE5PPS4_SIZE                                0x1
#define _RE5PPS_RE5PPS4_LENGTH                              0x1
#define _RE5PPS_RE5PPS4_MASK                                0x10
#define _RE5PPS_RE5PPS5_POSN                                0x5
#define _RE5PPS_RE5PPS5_POSITION                            0x5
#define _RE5PPS_RE5PPS5_SIZE                                0x1
#define _RE5PPS_RE5PPS5_LENGTH                              0x1
#define _RE5PPS_RE5PPS5_MASK                                0x20

// Register: RE6PPS
#define RE6PPS RE6PPS
extern volatile unsigned char           RE6PPS              __at(0x1F36);
#ifndef _LIB_BUILD
asm("RE6PPS equ 01F36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE6PPS0                :1;
        unsigned RE6PPS1                :1;
        unsigned RE6PPS2                :1;
        unsigned RE6PPS3                :1;
        unsigned RE6PPS4                :1;
        unsigned RE6PPS5                :1;
    };
} RE6PPSbits_t;
extern volatile RE6PPSbits_t RE6PPSbits __at(0x1F36);
// bitfield macros
#define _RE6PPS_RE6PPS0_POSN                                0x0
#define _RE6PPS_RE6PPS0_POSITION                            0x0
#define _RE6PPS_RE6PPS0_SIZE                                0x1
#define _RE6PPS_RE6PPS0_LENGTH                              0x1
#define _RE6PPS_RE6PPS0_MASK                                0x1
#define _RE6PPS_RE6PPS1_POSN                                0x1
#define _RE6PPS_RE6PPS1_POSITION                            0x1
#define _RE6PPS_RE6PPS1_SIZE                                0x1
#define _RE6PPS_RE6PPS1_LENGTH                              0x1
#define _RE6PPS_RE6PPS1_MASK                                0x2
#define _RE6PPS_RE6PPS2_POSN                                0x2
#define _RE6PPS_RE6PPS2_POSITION                            0x2
#define _RE6PPS_RE6PPS2_SIZE                                0x1
#define _RE6PPS_RE6PPS2_LENGTH                              0x1
#define _RE6PPS_RE6PPS2_MASK                                0x4
#define _RE6PPS_RE6PPS3_POSN                                0x3
#define _RE6PPS_RE6PPS3_POSITION                            0x3
#define _RE6PPS_RE6PPS3_SIZE                                0x1
#define _RE6PPS_RE6PPS3_LENGTH                              0x1
#define _RE6PPS_RE6PPS3_MASK                                0x8
#define _RE6PPS_RE6PPS4_POSN                                0x4
#define _RE6PPS_RE6PPS4_POSITION                            0x4
#define _RE6PPS_RE6PPS4_SIZE                                0x1
#define _RE6PPS_RE6PPS4_LENGTH                              0x1
#define _RE6PPS_RE6PPS4_MASK                                0x10
#define _RE6PPS_RE6PPS5_POSN                                0x5
#define _RE6PPS_RE6PPS5_POSITION                            0x5
#define _RE6PPS_RE6PPS5_SIZE                                0x1
#define _RE6PPS_RE6PPS5_LENGTH                              0x1
#define _RE6PPS_RE6PPS5_MASK                                0x20

// Register: RE7PPS
#define RE7PPS RE7PPS
extern volatile unsigned char           RE7PPS              __at(0x1F37);
#ifndef _LIB_BUILD
asm("RE7PPS equ 01F37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE7PPS0                :1;
        unsigned RE7PPS1                :1;
        unsigned RE7PPS2                :1;
        unsigned RE7PPS3                :1;
        unsigned RE7PPS4                :1;
        unsigned RE7PPS5                :1;
    };
} RE7PPSbits_t;
extern volatile RE7PPSbits_t RE7PPSbits __at(0x1F37);
// bitfield macros
#define _RE7PPS_RE7PPS0_POSN                                0x0
#define _RE7PPS_RE7PPS0_POSITION                            0x0
#define _RE7PPS_RE7PPS0_SIZE                                0x1
#define _RE7PPS_RE7PPS0_LENGTH                              0x1
#define _RE7PPS_RE7PPS0_MASK                                0x1
#define _RE7PPS_RE7PPS1_POSN                                0x1
#define _RE7PPS_RE7PPS1_POSITION                            0x1
#define _RE7PPS_RE7PPS1_SIZE                                0x1
#define _RE7PPS_RE7PPS1_LENGTH                              0x1
#define _RE7PPS_RE7PPS1_MASK                                0x2
#define _RE7PPS_RE7PPS2_POSN                                0x2
#define _RE7PPS_RE7PPS2_POSITION                            0x2
#define _RE7PPS_RE7PPS2_SIZE                                0x1
#define _RE7PPS_RE7PPS2_LENGTH                              0x1
#define _RE7PPS_RE7PPS2_MASK                                0x4
#define _RE7PPS_RE7PPS3_POSN                                0x3
#define _RE7PPS_RE7PPS3_POSITION                            0x3
#define _RE7PPS_RE7PPS3_SIZE                                0x1
#define _RE7PPS_RE7PPS3_LENGTH                              0x1
#define _RE7PPS_RE7PPS3_MASK                                0x8
#define _RE7PPS_RE7PPS4_POSN                                0x4
#define _RE7PPS_RE7PPS4_POSITION                            0x4
#define _RE7PPS_RE7PPS4_SIZE                                0x1
#define _RE7PPS_RE7PPS4_LENGTH                              0x1
#define _RE7PPS_RE7PPS4_MASK                                0x10
#define _RE7PPS_RE7PPS5_POSN                                0x5
#define _RE7PPS_RE7PPS5_POSITION                            0x5
#define _RE7PPS_RE7PPS5_SIZE                                0x1
#define _RE7PPS_RE7PPS5_LENGTH                              0x1
#define _RE7PPS_RE7PPS5_MASK                                0x20

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x1F38);
#ifndef _LIB_BUILD
asm("ANSELA equ 01F38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
        unsigned                        :1;
        unsigned ANSA6                  :1;
        unsigned ANSA7                  :1;
    };
} ANSELAbits_t;
