GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.h
extern volatile IOCEPbits_t IOCEPbits __at(0x1F69);
// bitfield macros
#define _IOCEP_IOCEP0_POSN                                  0x0
#define _IOCEP_IOCEP0_POSITION                              0x0
#define _IOCEP_IOCEP0_SIZE                                  0x1
#define _IOCEP_IOCEP0_LENGTH                                0x1
#define _IOCEP_IOCEP0_MASK                                  0x1
#define _IOCEP_IOCEP1_POSN                                  0x1
#define _IOCEP_IOCEP1_POSITION                              0x1
#define _IOCEP_IOCEP1_SIZE                                  0x1
#define _IOCEP_IOCEP1_LENGTH                                0x1
#define _IOCEP_IOCEP1_MASK                                  0x2
#define _IOCEP_IOCEP2_POSN                                  0x2
#define _IOCEP_IOCEP2_POSITION                              0x2
#define _IOCEP_IOCEP2_SIZE                                  0x1
#define _IOCEP_IOCEP2_LENGTH                                0x1
#define _IOCEP_IOCEP2_MASK                                  0x4
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8
#define _IOCEP_IOCEP4_POSN                                  0x4
#define _IOCEP_IOCEP4_POSITION                              0x4
#define _IOCEP_IOCEP4_SIZE                                  0x1
#define _IOCEP_IOCEP4_LENGTH                                0x1
#define _IOCEP_IOCEP4_MASK                                  0x10
#define _IOCEP_IOCEP5_POSN                                  0x5
#define _IOCEP_IOCEP5_POSITION                              0x5
#define _IOCEP_IOCEP5_SIZE                                  0x1
#define _IOCEP_IOCEP5_LENGTH                                0x1
#define _IOCEP_IOCEP5_MASK                                  0x20
#define _IOCEP_IOCEP6_POSN                                  0x6
#define _IOCEP_IOCEP6_POSITION                              0x6
#define _IOCEP_IOCEP6_SIZE                                  0x1
#define _IOCEP_IOCEP6_LENGTH                                0x1
#define _IOCEP_IOCEP6_MASK                                  0x40
#define _IOCEP_IOCEP7_POSN                                  0x7
#define _IOCEP_IOCEP7_POSITION                              0x7
#define _IOCEP_IOCEP7_SIZE                                  0x1
#define _IOCEP_IOCEP7_LENGTH                                0x1
#define _IOCEP_IOCEP7_MASK                                  0x80

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x1F6A);
#ifndef _LIB_BUILD
asm("IOCEN equ 01F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEN0                 :1;
        unsigned IOCEN1                 :1;
        unsigned IOCEN2                 :1;
        unsigned IOCEN3                 :1;
        unsigned IOCEN4                 :1;
        unsigned IOCEN5                 :1;
        unsigned IOCEN6                 :1;
        unsigned IOCEN7                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0x1F6A);
// bitfield macros
#define _IOCEN_IOCEN0_POSN                                  0x0
#define _IOCEN_IOCEN0_POSITION                              0x0
#define _IOCEN_IOCEN0_SIZE                                  0x1
#define _IOCEN_IOCEN0_LENGTH                                0x1
#define _IOCEN_IOCEN0_MASK                                  0x1
#define _IOCEN_IOCEN1_POSN                                  0x1
#define _IOCEN_IOCEN1_POSITION                              0x1
#define _IOCEN_IOCEN1_SIZE                                  0x1
#define _IOCEN_IOCEN1_LENGTH                                0x1
#define _IOCEN_IOCEN1_MASK                                  0x2
#define _IOCEN_IOCEN2_POSN                                  0x2
#define _IOCEN_IOCEN2_POSITION                              0x2
#define _IOCEN_IOCEN2_SIZE                                  0x1
#define _IOCEN_IOCEN2_LENGTH                                0x1
#define _IOCEN_IOCEN2_MASK                                  0x4
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8
#define _IOCEN_IOCEN4_POSN                                  0x4
#define _IOCEN_IOCEN4_POSITION                              0x4
#define _IOCEN_IOCEN4_SIZE                                  0x1
#define _IOCEN_IOCEN4_LENGTH                                0x1
#define _IOCEN_IOCEN4_MASK                                  0x10
#define _IOCEN_IOCEN5_POSN                                  0x5
#define _IOCEN_IOCEN5_POSITION                              0x5
#define _IOCEN_IOCEN5_SIZE                                  0x1
#define _IOCEN_IOCEN5_LENGTH                                0x1
#define _IOCEN_IOCEN5_MASK                                  0x20
#define _IOCEN_IOCEN6_POSN                                  0x6
#define _IOCEN_IOCEN6_POSITION                              0x6
#define _IOCEN_IOCEN6_SIZE                                  0x1
#define _IOCEN_IOCEN6_LENGTH                                0x1
#define _IOCEN_IOCEN6_MASK                                  0x40
#define _IOCEN_IOCEN7_POSN                                  0x7
#define _IOCEN_IOCEN7_POSITION                              0x7
#define _IOCEN_IOCEN7_SIZE                                  0x1
#define _IOCEN_IOCEN7_LENGTH                                0x1
#define _IOCEN_IOCEN7_MASK                                  0x80

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x1F6B);
#ifndef _LIB_BUILD
asm("IOCEF equ 01F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEF0                 :1;
        unsigned IOCEF1                 :1;
        unsigned IOCEF2                 :1;
        unsigned IOCEF3                 :1;
        unsigned IOCEF4                 :1;
        unsigned IOCEF5                 :1;
        unsigned IOCEF6                 :1;
        unsigned IOCEF7                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x1F6B);
// bitfield macros
#define _IOCEF_IOCEF0_POSN                                  0x0
#define _IOCEF_IOCEF0_POSITION                              0x0
#define _IOCEF_IOCEF0_SIZE                                  0x1
#define _IOCEF_IOCEF0_LENGTH                                0x1
#define _IOCEF_IOCEF0_MASK                                  0x1
#define _IOCEF_IOCEF1_POSN                                  0x1
#define _IOCEF_IOCEF1_POSITION                              0x1
#define _IOCEF_IOCEF1_SIZE                                  0x1
#define _IOCEF_IOCEF1_LENGTH                                0x1
#define _IOCEF_IOCEF1_MASK                                  0x2
#define _IOCEF_IOCEF2_POSN                                  0x2
#define _IOCEF_IOCEF2_POSITION                              0x2
#define _IOCEF_IOCEF2_SIZE                                  0x1
#define _IOCEF_IOCEF2_LENGTH                                0x1
#define _IOCEF_IOCEF2_MASK                                  0x4
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8
#define _IOCEF_IOCEF4_POSN                                  0x4
#define _IOCEF_IOCEF4_POSITION                              0x4
#define _IOCEF_IOCEF4_SIZE                                  0x1
#define _IOCEF_IOCEF4_LENGTH                                0x1
#define _IOCEF_IOCEF4_MASK                                  0x10
#define _IOCEF_IOCEF5_POSN                                  0x5
#define _IOCEF_IOCEF5_POSITION                              0x5
#define _IOCEF_IOCEF5_SIZE                                  0x1
#define _IOCEF_IOCEF5_LENGTH                                0x1
#define _IOCEF_IOCEF5_MASK                                  0x20
#define _IOCEF_IOCEF6_POSN                                  0x6
#define _IOCEF_IOCEF6_POSITION                              0x6
#define _IOCEF_IOCEF6_SIZE                                  0x1
#define _IOCEF_IOCEF6_LENGTH                                0x1
#define _IOCEF_IOCEF6_MASK                                  0x40
#define _IOCEF_IOCEF7_POSN                                  0x7
#define _IOCEF_IOCEF7_POSITION                              0x7
#define _IOCEF_IOCEF7_SIZE                                  0x1
#define _IOCEF_IOCEF7_LENGTH                                0x1
#define _IOCEF_IOCEF7_MASK                                  0x80

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0x1FE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 01FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0x1FE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0x1FE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 01FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0x1FE5);
// bitfield macros
#define _WREG_SHAD_WREG_SHAD_POSN                           0x0
#define _WREG_SHAD_WREG_SHAD_POSITION                       0x0
#define _WREG_SHAD_WREG_SHAD_SIZE                           0x8
#define _WREG_SHAD_WREG_SHAD_LENGTH                         0x8
#define _WREG_SHAD_WREG_SHAD_MASK                           0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0x1FE6);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 01FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_SHAD               :5;
    };
} BSR_SHADbits_t;
extern volatile BSR_SHADbits_t BSR_SHADbits __at(0x1FE6);
// bitfield macros
#define _BSR_SHAD_BSR_SHAD_POSN                             0x0
#define _BSR_SHAD_BSR_SHAD_POSITION                         0x0
#define _BSR_SHAD_BSR_SHAD_SIZE                             0x5
#define _BSR_SHAD_BSR_SHAD_LENGTH                           0x5
#define _BSR_SHAD_BSR_SHAD_MASK                             0x1F

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0x1FE7);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 01FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH_SHAD            :7;
    };
} PCLATH_SHADbits_t;
