GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.h
extern volatile __bit                   AMASK3              __at(0x6075);	// @ (0xC0E * 8 + 5)
#define                                 AMASK3_bit          _BIT_ACCESS(ALRMCON,5)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xF9C0);	// @ (0x1F38 * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xF9C1);	// @ (0x1F38 * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xF9C2);	// @ (0x1F38 * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA3>
extern volatile __bit                   ANSA3               __at(0xF9C3);	// @ (0x1F38 * 8 + 3)
#define                                 ANSA3_bit           _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xF9C4);	// @ (0x1F38 * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSA6>
extern volatile __bit                   ANSA6               __at(0xF9C6);	// @ (0x1F38 * 8 + 6)
#define                                 ANSA6_bit           _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSA7>
extern volatile __bit                   ANSA7               __at(0xF9C7);	// @ (0x1F38 * 8 + 7)
#define                                 ANSA7_bit           _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSB0>
extern volatile __bit                   ANSB0               __at(0xFA18);	// @ (0x1F43 * 8 + 0)
#define                                 ANSB0_bit           _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSB1>
extern volatile __bit                   ANSB1               __at(0xFA19);	// @ (0x1F43 * 8 + 1)
#define                                 ANSB1_bit           _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSB2>
extern volatile __bit                   ANSB2               __at(0xFA1A);	// @ (0x1F43 * 8 + 2)
#define                                 ANSB2_bit           _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSB3>
extern volatile __bit                   ANSB3               __at(0xFA1B);	// @ (0x1F43 * 8 + 3)
#define                                 ANSB3_bit           _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSB4>
extern volatile __bit                   ANSB4               __at(0xFA1C);	// @ (0x1F43 * 8 + 4)
#define                                 ANSB4_bit           _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSB5>
extern volatile __bit                   ANSB5               __at(0xFA1D);	// @ (0x1F43 * 8 + 5)
#define                                 ANSB5_bit           _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSB6>
extern volatile __bit                   ANSB6               __at(0xFA1E);	// @ (0x1F43 * 8 + 6)
#define                                 ANSB6_bit           _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSB7>
extern volatile __bit                   ANSB7               __at(0xFA1F);	// @ (0x1F43 * 8 + 7)
#define                                 ANSB7_bit           _BIT_ACCESS(ANSELB,7)
// ANSELD<ANSD0>
extern volatile __bit                   ANSD0               __at(0xFAC8);	// @ (0x1F59 * 8 + 0)
#define                                 ANSD0_bit           _BIT_ACCESS(ANSELD,0)
// ANSELD<ANSD1>
extern volatile __bit                   ANSD1               __at(0xFAC9);	// @ (0x1F59 * 8 + 1)
#define                                 ANSD1_bit           _BIT_ACCESS(ANSELD,1)
// ANSELD<ANSD2>
extern volatile __bit                   ANSD2               __at(0xFACA);	// @ (0x1F59 * 8 + 2)
#define                                 ANSD2_bit           _BIT_ACCESS(ANSELD,2)
// ANSELD<ANSD3>
extern volatile __bit                   ANSD3               __at(0xFACB);	// @ (0x1F59 * 8 + 3)
#define                                 ANSD3_bit           _BIT_ACCESS(ANSELD,3)
// ANSELD<ANSD4>
extern volatile __bit                   ANSD4               __at(0xFACC);	// @ (0x1F59 * 8 + 4)
#define                                 ANSD4_bit           _BIT_ACCESS(ANSELD,4)
// ANSELD<ANSD5>
extern volatile __bit                   ANSD5               __at(0xFACD);	// @ (0x1F59 * 8 + 5)
#define                                 ANSD5_bit           _BIT_ACCESS(ANSELD,5)
// ANSELD<ANSD6>
extern volatile __bit                   ANSD6               __at(0xFACE);	// @ (0x1F59 * 8 + 6)
#define                                 ANSD6_bit           _BIT_ACCESS(ANSELD,6)
// ANSELD<ANSD7>
extern volatile __bit                   ANSD7               __at(0xFACF);	// @ (0x1F59 * 8 + 7)
#define                                 ANSD7_bit           _BIT_ACCESS(ANSELD,7)
// ANSELE<ANSE0>
extern volatile __bit                   ANSE0               __at(0xFB20);	// @ (0x1F64 * 8 + 0)
#define                                 ANSE0_bit           _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSE1>
extern volatile __bit                   ANSE1               __at(0xFB21);	// @ (0x1F64 * 8 + 1)
#define                                 ANSE1_bit           _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSE3>
extern volatile __bit                   ANSE3               __at(0xFB23);	// @ (0x1F64 * 8 + 3)
#define                                 ANSE3_bit           _BIT_ACCESS(ANSELE,3)
// ANSELE<ANSE4>
extern volatile __bit                   ANSE4               __at(0xFB24);	// @ (0x1F64 * 8 + 4)
#define                                 ANSE4_bit           _BIT_ACCESS(ANSELE,4)
// ANSELE<ANSE5>
extern volatile __bit                   ANSE5               __at(0xFB25);	// @ (0x1F64 * 8 + 5)
#define                                 ANSE5_bit           _BIT_ACCESS(ANSELE,5)
// ANSELE<ANSE6>
extern volatile __bit                   ANSE6               __at(0xFB26);	// @ (0x1F64 * 8 + 6)
#define                                 ANSE6_bit           _BIT_ACCESS(ANSELE,6)
// ANSELE<ANSE7>
extern volatile __bit                   ANSE7               __at(0xFB27);	// @ (0x1F64 * 8 + 7)
#define                                 ANSE7_bit           _BIT_ACCESS(ANSELE,7)
// ANSELH<ANSELH0>
extern volatile __bit                   ANSELH0             __at(0xF330);	// @ (0x1E66 * 8 + 0)
#define                                 ANSELH0_bit         _BIT_ACCESS(ANSELH,0)
// ANSELH<ANSELH1>
extern volatile __bit                   ANSELH1             __at(0xF331);	// @ (0x1E66 * 8 + 1)
#define                                 ANSELH1_bit         _BIT_ACCESS(ANSELH,1)
// ANSELH<ANSELH2>
extern volatile __bit                   ANSELH2             __at(0xF332);	// @ (0x1E66 * 8 + 2)
#define                                 ANSELH2_bit         _BIT_ACCESS(ANSELH,2)
// ANSELH<ANSELH3>
extern volatile __bit                   ANSELH3             __at(0xF333);	// @ (0x1E66 * 8 + 3)
#define                                 ANSELH3_bit         _BIT_ACCESS(ANSELH,3)
// ANSELF<ANSF0>
extern volatile __bit                   ANSF0               __at(0xF280);	// @ (0x1E50 * 8 + 0)
#define                                 ANSF0_bit           _BIT_ACCESS(ANSELF,0)
// ANSELF<ANSF1>
extern volatile __bit                   ANSF1               __at(0xF281);	// @ (0x1E50 * 8 + 1)
#define                                 ANSF1_bit           _BIT_ACCESS(ANSELF,1)
// ANSELF<ANSF2>
extern volatile __bit                   ANSF2               __at(0xF282);	// @ (0x1E50 * 8 + 2)
#define                                 ANSF2_bit           _BIT_ACCESS(ANSELF,2)
// ANSELF<ANSF3>
extern volatile __bit                   ANSF3               __at(0xF283);	// @ (0x1E50 * 8 + 3)
#define                                 ANSF3_bit           _BIT_ACCESS(ANSELF,3)
// ANSELF<ANSF4>
extern volatile __bit                   ANSF4               __at(0xF284);	// @ (0x1E50 * 8 + 4)
#define                                 ANSF4_bit           _BIT_ACCESS(ANSELF,4)
// ANSELF<ANSF5>
extern volatile __bit                   ANSF5               __at(0xF285);	// @ (0x1E50 * 8 + 5)
#define                                 ANSF5_bit           _BIT_ACCESS(ANSELF,5)
// ANSELF<ANSF6>
extern volatile __bit                   ANSF6               __at(0xF286);	// @ (0x1E50 * 8 + 6)
#define                                 ANSF6_bit           _BIT_ACCESS(ANSELF,6)
// ANSELF<ANSF7>
extern volatile __bit                   ANSF7               __at(0xF287);	// @ (0x1E50 * 8 + 7)
#define                                 ANSF7_bit           _BIT_ACCESS(ANSELF,7)
// ANSELG<ANSG0>
extern volatile __bit                   ANSG0               __at(0xF2D8);	// @ (0x1E5B * 8 + 0)
#define                                 ANSG0_bit           _BIT_ACCESS(ANSELG,0)
// ANSELG<ANSG1>
extern volatile __bit                   ANSG1               __at(0xF2D9);	// @ (0x1E5B * 8 + 1)
#define                                 ANSG1_bit           _BIT_ACCESS(ANSELG,1)
// ANSELG<ANSG2>
extern volatile __bit                   ANSG2               __at(0xF2DA);	// @ (0x1E5B * 8 + 2)
#define                                 ANSG2_bit           _BIT_ACCESS(ANSELG,2)
// ANSELG<ANSG3>
extern volatile __bit                   ANSG3               __at(0xF2DB);	// @ (0x1E5B * 8 + 3)
#define                                 ANSG3_bit           _BIT_ACCESS(ANSELG,3)
// ANSELG<ANSG4>
extern volatile __bit                   ANSG4               __at(0xF2DC);	// @ (0x1E5B * 8 + 4)
#define                                 ANSG4_bit           _BIT_ACCESS(ANSELG,4)
// ANSELG<ANSG6>
extern volatile __bit                   ANSG6               __at(0xF2DE);	// @ (0x1E5B * 8 + 6)
#define                                 ANSG6_bit           _BIT_ACCESS(ANSELG,6)
// ANSELG<ANSG7>
extern volatile __bit                   ANSG7               __at(0xF2DF);	// @ (0x1E5B * 8 + 7)
#define                                 ANSG7_bit           _BIT_ACCESS(ANSELG,7)
// ALRMRPT<ARPT0>
extern volatile __bit                   ARPT0               __at(0x6078);	// @ (0xC0F * 8 + 0)
#define                                 ARPT0_bit           _BIT_ACCESS(ALRMRPT,0)
// ALRMRPT<ARPT1>
extern volatile __bit                   ARPT1               __at(0x6079);	// @ (0xC0F * 8 + 1)
#define                                 ARPT1_bit           _BIT_ACCESS(ALRMRPT,1)
// ALRMRPT<ARPT2>
extern volatile __bit                   ARPT2               __at(0x607A);	// @ (0xC0F * 8 + 2)
#define                                 ARPT2_bit           _BIT_ACCESS(ALRMRPT,2)
// ALRMRPT<ARPT3>
extern volatile __bit                   ARPT3               __at(0x607B);	// @ (0xC0F * 8 + 3)
#define                                 ARPT3_bit           _BIT_ACCESS(ALRMRPT,3)
// ALRMRPT<ARPT4>
extern volatile __bit                   ARPT4               __at(0x607C);	// @ (0xC0F * 8 + 4)
#define                                 ARPT4_bit           _BIT_ACCESS(ALRMRPT,4)
// ALRMRPT<ARPT5>
extern volatile __bit                   ARPT5               __at(0x607D);	// @ (0xC0F * 8 + 5)
#define                                 ARPT5_bit           _BIT_ACCESS(ALRMRPT,5)
// ALRMRPT<ARPT6>
extern volatile __bit                   ARPT6               __at(0x607E);	// @ (0xC0F * 8 + 6)
#define                                 ARPT6_bit           _BIT_ACCESS(ALRMRPT,6)
// ALRMRPT<ARPT7>
extern volatile __bit                   ARPT7               __at(0x607F);	// @ (0xC0F * 8 + 7)
#define                                 ARPT7_bit           _BIT_ACCESS(ALRMRPT,7)
// SMT1STAT<AS>
extern volatile __bit                   AS                  __at(0x24D0);	// @ (0x49A * 8 + 0)
#define                                 AS_bit              _BIT_ACCESS(SMT1STAT,0)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x309B);	// @ (0x613 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x309C);	// @ (0x613 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// PIE3<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x3879);	// @ (0x70F * 8 + 1)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR3,1)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0xC78);	// @ (0x18F * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0xC78);	// @ (0x18F * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// LCDVCON1<BIAS0>
extern volatile __bit                   BIAS0               __at(0xE8A0);	// @ (0x1D14 * 8 + 0)
#define                                 BIAS0_bit           _BIT_ACCESS(LCDVCON1,0)
// LCDVCON1<BIAS1>
extern volatile __bit                   BIAS1               __at(0xE8A1);	// @ (0x1D14 * 8 + 1)
#define                                 BIAS1_bit           _BIT_ACCESS(LCDVCON1,1)
// LCDVCON1<BIAS2>
extern volatile __bit                   BIAS2               __at(0xE8A2);	// @ (0x1D14 * 8 + 2)
#define                                 BIAS2_bit           _BIT_ACCESS(LCDVCON1,2)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0xC94);	// @ (0x192 * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// BSR<BSR5>
extern volatile __bit                   BSR5                __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 BSR5_bit            _BIT_ACCESS(BSR,5)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x4C81);	// @ (0x990 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,0)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x3870);	// @ (0x70E * 8 + 0)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,0)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x4C88);	// @ (0x991 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x4C89);	// @ (0x991 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// CM1NSEL<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x4C90);	// @ (0x992 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NSEL,0)
// CM1NSEL<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x4C91);	// @ (0x992 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NSEL,1)
// CM1NSEL<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x4C92);	// @ (0x992 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NSEL,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x4C87);	// @ (0x990 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1PSEL<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x4C98);	// @ (0x993 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PSEL,0)
// CM1PSEL<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x4C99);	// @ (0x993 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PSEL,1)
// CM1PSEL<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x4C9A);	// @ (0x993 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PSEL,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x4C84);	// @ (0x990 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x4C80);	// @ (0x990 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x10F0);	// @ (0x21E * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x10F1);	// @ (0x21E * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x4CA1);	// @ (0x994 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x38C1);	// @ (0x718 * 8 + 1)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,1)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x3871);	// @ (0x70E * 8 + 1)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,1)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x4CA8);	// @ (0x995 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x4CA9);	// @ (0x995 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// CM2NSEL<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x4CB0);	// @ (0x996 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NSEL,0)
// CM2NSEL<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x4CB1);	// @ (0x996 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NSEL,1)
// CM2NSEL<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x4CB2);	// @ (0x996 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NSEL,2)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x4CA7);	// @ (0x994 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2PSEL<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x4CB8);	// @ (0x997 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PSEL,0)
// CM2PSEL<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x4CB9);	// @ (0x997 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PSEL,1)
// CM2PSEL<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x4CBA);	// @ (0x997 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PSEL,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x4CA4);	// @ (0x994 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x4CA0);	// @ (0x994 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x10F2);	// @ (0x21E * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x10F3);	// @ (0x21E * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// RTCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x6068);	// @ (0xC0D * 8 + 0)
#define                                 CAL0_bit            _BIT_ACCESS(RTCCAL,0)
// TMR1L<CAL01>
extern volatile __bit                   CAL01               __at(0x1060);	// @ (0x20C * 8 + 0)
#define                                 CAL01_bit           _BIT_ACCESS(TMR1L,0)
// RTCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x6069);	// @ (0xC0D * 8 + 1)
#define                                 CAL1_bit            _BIT_ACCESS(RTCCAL,1)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x1061);	// @ (0x20C * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// RTCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x606A);	// @ (0xC0D * 8 + 2)
#define                                 CAL2_bit            _BIT_ACCESS(RTCCAL,2)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// RTCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x606B);	// @ (0xC0D * 8 + 3)
#define                                 CAL3_bit            _BIT_ACCESS(RTCCAL,3)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// RTCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x606C);	// @ (0xC0D * 8 + 4)
#define                                 CAL4_bit            _BIT_ACCESS(RTCCAL,4)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x1064);	// @ (0x20C * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// RTCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x606D);	// @ (0xC0D * 8 + 5)
#define                                 CAL5_bit            _BIT_ACCESS(RTCCAL,5)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x1065);	// @ (0x20C * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// RTCCAL<CAL6>
